{"config": [{"config": {"activity_regularizer": null, "kernel_size": [9], "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "dilation_rate": [1], "filters": 96, "bias_constraint": null, "strides": [1], "activation": "linear", "batch_input_shape": [null, 34, 20], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "dtype": "float32", "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv1d_1", "bias_regularizer": null, "use_bias": true}, "class_name": "Conv1D"}, {"config": {"trainable": true, "name": "dropout_1", "noise_shape": null, "seed": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"padding": "valid", "name": "max_pooling1d_1", "pool_size": [2], "strides": [2], "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"activity_regularizer": null, "kernel_size": [9], "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "dilation_rate": [1], "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "strides": [1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "filters": 128, "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv1d_2", "use_bias": true}, "class_name": "Conv1D"}, {"config": {"activity_regularizer": null, "kernel_size": [9], "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "dilation_rate": [1], "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "strides": [1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "filters": 256, "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv1d_3", "use_bias": true}, "class_name": "Conv1D"}, {"config": {"activity_regularizer": null, "kernel_size": [8], "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "dilation_rate": [1], "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "strides": [1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "filters": 512, "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv1d_4", "use_bias": true}, "class_name": "Conv1D"}, {"config": {"activity_regularizer": null, "kernel_size": [3], "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "dilation_rate": [1], "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "strides": [1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "filters": 1024, "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv1d_5", "use_bias": true}, "class_name": "Conv1D"}, {"config": {"padding": "valid", "name": "max_pooling1d_2", "pool_size": [1], "strides": [1], "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"activity_regularizer": null, "kernel_size": [1], "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "dilation_rate": [1], "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "strides": [1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "filters": 144, "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv1d_6", "use_bias": true}, "class_name": "Conv1D"}, {"config": {"name": "global_max_pooling1d_1", "trainable": true}, "class_name": "GlobalMaxPooling1D"}, {"config": {"units": 128, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "name": "dense_1", "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "noise_shape": null, "seed": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"units": 2, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_constraint": null, "activation": "softmax", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "name": "output_layer", "use_bias": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6"}