{"keras_version": "2.1.6", "backend": "tensorflow", "config": [{"class_name": "Conv1D", "config": {"dilation_rate": [1], "trainable": true, "bias_regularizer": null, "name": "conv1d_1", "dtype": "float32", "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "strides": [1], "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 34, 20], "filters": 96, "kernel_size": [9], "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "activation": "linear"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "padding": "valid", "pool_size": [2], "name": "max_pooling1d_1", "strides": [2]}}, {"class_name": "Conv1D", "config": {"dilation_rate": [1], "trainable": true, "bias_regularizer": null, "name": "conv1d_2", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "strides": [1], "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "filters": 128, "kernel_size": [9], "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "padding": "valid", "pool_size": [2], "name": "max_pooling1d_2", "strides": [2]}}, {"class_name": "Conv1D", "config": {"dilation_rate": [1], "trainable": true, "bias_regularizer": null, "name": "conv1d_3", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "strides": [1], "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "filters": 256, "kernel_size": [9], "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "padding": "valid", "pool_size": [2], "name": "max_pooling1d_3", "strides": [2]}}, {"class_name": "Conv1D", "config": {"dilation_rate": [1], "trainable": true, "bias_regularizer": null, "name": "conv1d_4", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "strides": [1], "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "filters": 512, "kernel_size": [8], "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "padding": "valid", "pool_size": [2], "name": "max_pooling1d_4", "strides": [2]}}, {"class_name": "Conv1D", "config": {"dilation_rate": [1], "trainable": true, "bias_regularizer": null, "name": "conv1d_5", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "strides": [1], "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "filters": 1024, "kernel_size": [3], "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "padding": "valid", "pool_size": [1], "name": "max_pooling1d_5", "strides": [1]}}, {"class_name": "Conv1D", "config": {"dilation_rate": [1], "trainable": true, "bias_regularizer": null, "name": "conv1d_6", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "strides": [1], "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "filters": 144, "kernel_size": [1], "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "activation": "relu"}}, {"class_name": "GlobalMaxPooling1D", "config": {"trainable": true, "name": "global_max_pooling1d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.1, "name": "dropout_1", "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "bias_regularizer": null, "units": 2, "name": "output_layer", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "softmax"}}], "class_name": "Sequential"}