{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv1D", "config": {"dtype": "float32", "filters": 96, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "dilation_rate": [1], "batch_input_shape": [null, 34, 20], "trainable": true, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "use_bias": true, "kernel_size": [9], "name": "conv1d_1", "bias_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "trainable": true, "padding": "valid", "strides": [2], "pool_size": [2]}}, {"class_name": "Conv1D", "config": {"filters": 128, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "dilation_rate": [1], "strides": [1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [9], "name": "conv1d_2", "bias_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "trainable": true, "padding": "valid", "strides": [2], "pool_size": [2]}}, {"class_name": "Conv1D", "config": {"filters": 256, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "dilation_rate": [1], "strides": [1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [9], "name": "conv1d_3", "bias_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_3", "trainable": true, "padding": "valid", "strides": [2], "pool_size": [2]}}, {"class_name": "Conv1D", "config": {"filters": 512, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "dilation_rate": [1], "strides": [1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [8], "name": "conv1d_4", "bias_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_4", "trainable": true, "padding": "valid", "strides": [2], "pool_size": [2]}}, {"class_name": "Conv1D", "config": {"filters": 1024, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "dilation_rate": [1], "strides": [1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [3], "name": "conv1d_5", "bias_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5", "trainable": true, "padding": "valid", "strides": [1], "pool_size": [1]}}, {"class_name": "Conv1D", "config": {"filters": 144, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "dilation_rate": [1], "strides": [1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [1], "name": "conv1d_6", "bias_regularizer": null}}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_1", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null, "rate": 0.1}}, {"class_name": "Dense", "config": {"units": 2, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "activation": "softmax", "name": "output_layer", "bias_regularizer": null}}], "keras_version": "2.1.6"}