{"keras_version": "2.1.6", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "kernel_size": [9], "use_bias": true, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "name": "conv1d_1", "activation": "linear", "batch_input_shape": [null, 34, 20], "dtype": "float32", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "activity_regularizer": null, "dilation_rate": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 96, "padding": "valid"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "strides": [2], "pool_size": [2], "name": "max_pooling1d_1", "padding": "valid"}}, {"class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "kernel_size": [9], "use_bias": true, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "name": "conv1d_2", "dilation_rate": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 128, "padding": "same"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "strides": [2], "pool_size": [2], "name": "max_pooling1d_2", "padding": "valid"}}, {"class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "kernel_size": [9], "use_bias": true, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "name": "conv1d_3", "dilation_rate": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 256, "padding": "same"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "strides": [2], "pool_size": [2], "name": "max_pooling1d_3", "padding": "valid"}}, {"class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "kernel_size": [8], "use_bias": true, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "name": "conv1d_4", "dilation_rate": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 512, "padding": "same"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "strides": [2], "pool_size": [2], "name": "max_pooling1d_4", "padding": "valid"}}, {"class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "kernel_size": [3], "use_bias": true, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "name": "conv1d_5", "dilation_rate": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 1024, "padding": "same"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "strides": [1], "pool_size": [1], "name": "max_pooling1d_5", "padding": "valid"}}, {"class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "kernel_size": [1], "use_bias": true, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "name": "conv1d_6", "dilation_rate": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 144, "padding": "same"}}, {"class_name": "GlobalMaxPooling1D", "config": {"trainable": true, "name": "global_max_pooling1d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "rate": 0.1, "name": "dropout_1", "seed": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "softmax", "units": 2, "kernel_regularizer": null, "name": "output_layer", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null}}]}