{"backend": "tensorflow", "keras_version": "2.1.6", "config": [{"config": {"activity_regularizer": null, "dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "dtype": "float32", "batch_input_shape": [null, 34, 20], "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv1d_1", "trainable": true, "strides": [1], "bias_regularizer": null, "bias_constraint": null, "padding": "same", "filters": 96, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [9], "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv1D"}, {"config": {"rate": 0.5, "name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"pool_size": [2], "padding": "valid", "name": "max_pooling1d_1", "trainable": true, "strides": [2]}, "class_name": "MaxPooling1D"}, {"config": {"activity_regularizer": null, "dilation_rate": [1], "activation": "relu", "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv1d_2", "trainable": true, "strides": [1], "bias_regularizer": null, "bias_constraint": null, "padding": "same", "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [9], "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv1D"}, {"config": {"pool_size": [2], "padding": "valid", "name": "max_pooling1d_2", "trainable": true, "strides": [2]}, "class_name": "MaxPooling1D"}, {"config": {"activity_regularizer": null, "dilation_rate": [1], "activation": "relu", "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv1d_3", "trainable": true, "strides": [1], "bias_regularizer": null, "bias_constraint": null, "padding": "same", "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [9], "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv1D"}, {"config": {"pool_size": [2], "padding": "valid", "name": "max_pooling1d_3", "trainable": true, "strides": [2]}, "class_name": "MaxPooling1D"}, {"config": {"activity_regularizer": null, "dilation_rate": [1], "activation": "relu", "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv1d_4", "trainable": true, "strides": [1], "bias_regularizer": null, "bias_constraint": null, "padding": "same", "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [8], "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv1D"}, {"config": {"pool_size": [2], "padding": "valid", "name": "max_pooling1d_4", "trainable": true, "strides": [2]}, "class_name": "MaxPooling1D"}, {"config": {"activity_regularizer": null, "dilation_rate": [1], "activation": "relu", "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv1d_5", "trainable": true, "strides": [1], "bias_regularizer": null, "bias_constraint": null, "padding": "same", "filters": 1024, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3], "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv1D"}, {"config": {"pool_size": [1], "padding": "valid", "name": "max_pooling1d_5", "trainable": true, "strides": [1]}, "class_name": "MaxPooling1D"}, {"config": {"activity_regularizer": null, "dilation_rate": [1], "activation": "relu", "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv1d_6", "trainable": true, "strides": [1], "bias_regularizer": null, "bias_constraint": null, "padding": "same", "filters": 144, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1], "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv1D"}, {"config": {"name": "global_max_pooling1d_1", "trainable": true}, "class_name": "GlobalMaxPooling1D"}, {"config": {"activity_regularizer": null, "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_1", "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 128}, "class_name": "Dense"}, {"config": {"rate": 0.25, "name": "dropout_2", "trainable": true, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "activation": "softmax", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "output_layer", "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 2}, "class_name": "Dense"}], "class_name": "Sequential"}