{"class_name": "Sequential", "keras_version": "2.1.6", "backend": "tensorflow", "config": [{"class_name": "Conv1D", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "filters": 96, "dilation_rate": [1], "activation": "linear", "padding": "same", "batch_input_shape": [null, 34, 20], "dtype": "float32", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "name": "conv1d_1", "activity_regularizer": null, "kernel_size": [9], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "noise_shape": null, "seed": null, "name": "dropout_1"}}, {"class_name": "MaxPooling1D", "config": {"strides": [2], "trainable": true, "pool_size": [2], "padding": "valid", "name": "max_pooling1d_1"}}, {"class_name": "Conv1D", "config": {"bias_constraint": null, "bias_regularizer": null, "filters": 128, "dilation_rate": [1], "activation": "relu", "padding": "same", "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "name": "conv1d_2", "activity_regularizer": null, "kernel_size": [9], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}}, {"class_name": "MaxPooling1D", "config": {"strides": [2], "trainable": true, "pool_size": [2], "padding": "valid", "name": "max_pooling1d_2"}}, {"class_name": "Conv1D", "config": {"bias_constraint": null, "bias_regularizer": null, "filters": 256, "dilation_rate": [1], "activation": "relu", "padding": "same", "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "name": "conv1d_3", "activity_regularizer": null, "kernel_size": [9], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}}, {"class_name": "MaxPooling1D", "config": {"strides": [2], "trainable": true, "pool_size": [2], "padding": "valid", "name": "max_pooling1d_3"}}, {"class_name": "Conv1D", "config": {"bias_constraint": null, "bias_regularizer": null, "filters": 512, "dilation_rate": [1], "activation": "relu", "padding": "same", "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "name": "conv1d_4", "activity_regularizer": null, "kernel_size": [8], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}}, {"class_name": "MaxPooling1D", "config": {"strides": [2], "trainable": true, "pool_size": [2], "padding": "valid", "name": "max_pooling1d_4"}}, {"class_name": "Conv1D", "config": {"bias_constraint": null, "bias_regularizer": null, "filters": 1024, "dilation_rate": [1], "activation": "relu", "padding": "same", "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "name": "conv1d_5", "activity_regularizer": null, "kernel_size": [3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}}, {"class_name": "MaxPooling1D", "config": {"strides": [1], "trainable": true, "pool_size": [1], "padding": "valid", "name": "max_pooling1d_5"}}, {"class_name": "Conv1D", "config": {"bias_constraint": null, "bias_regularizer": null, "filters": 144, "dilation_rate": [1], "activation": "relu", "padding": "same", "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "name": "conv1d_6", "activity_regularizer": null, "kernel_size": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "name": "dense_1", "activity_regularizer": null, "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "noise_shape": null, "seed": null, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_regularizer": null, "activation": "softmax", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "name": "output_layer", "activity_regularizer": null, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null}}]}