{"class_name": "Sequential", "config": [{"class_name": "Conv1D", "config": {"kernel_size": [9], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "batch_input_shape": [null, 34, 20], "bias_regularizer": null, "filters": 96, "use_bias": true, "dtype": "float32", "bias_constraint": null, "trainable": true, "dilation_rate": [1], "name": "conv1d_1", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "padding": "same"}}, {"class_name": "Conv1D", "config": {"kernel_size": [9], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "bias_regularizer": null, "filters": 64, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1], "name": "conv1d_2", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "trainable": true, "padding": "same"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.5, "name": "dropout_1", "seed": null, "trainable": true}}, {"class_name": "Conv1D", "config": {"kernel_size": [3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "bias_regularizer": null, "filters": 64, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1], "name": "conv1d_3", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "trainable": true, "padding": "same"}}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "trainable": true, "units": 128, "name": "dense_1", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.25, "name": "dropout_2", "seed": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "trainable": true, "units": 2, "name": "output_layer", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "kernel_constraint": null}}], "backend": "tensorflow", "keras_version": "2.1.6"}