{"keras_version": "2.1.6", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "use_bias": true, "batch_input_shape": [null, 34, 20], "name": "conv1d_1", "bias_constraint": null, "kernel_size": [9], "strides": [1], "dilation_rate": [1], "activity_regularizer": null, "filters": 96, "activation": "linear", "trainable": true, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.5}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "trainable": true, "padding": "valid", "strides": [2], "pool_size": [2]}}, {"class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "use_bias": true, "bias_regularizer": null, "name": "conv1d_2", "bias_constraint": null, "kernel_size": [9], "strides": [1], "dilation_rate": [1], "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "activation": "relu", "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "trainable": true, "padding": "valid", "strides": [2], "pool_size": [2]}}, {"class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "use_bias": true, "bias_regularizer": null, "name": "conv1d_3", "bias_constraint": null, "kernel_size": [9], "strides": [1], "dilation_rate": [1], "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "activation": "relu", "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_3", "trainable": true, "padding": "valid", "strides": [2], "pool_size": [2]}}, {"class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 144, "use_bias": true, "bias_regularizer": null, "name": "conv1d_4", "bias_constraint": null, "kernel_size": [1], "strides": [1], "dilation_rate": [1], "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "activation": "relu", "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null}}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "dense_1", "activity_regularizer": null, "kernel_regularizer": null, "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": true, "activation": "linear", "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.25}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "output_layer", "activity_regularizer": null, "kernel_regularizer": null, "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": true, "activation": "softmax", "kernel_constraint": null}}]}