{"keras_version": "2.1.6", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 96, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "activity_regularizer": null, "activation": "linear", "padding": "same", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "strides": [1], "name": "conv1d_1", "bias_regularizer": null, "dilation_rate": [1], "kernel_size": [9], "dtype": "float32", "bias_constraint": null, "batch_input_shape": [null, 34, 20]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.5}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "trainable": true, "pool_size": [2], "padding": "valid", "strides": [2]}}, {"class_name": "Conv1D", "config": {"activity_regularizer": null, "filters": 128, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "padding": "same", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "strides": [1], "name": "conv1d_2", "bias_regularizer": null, "dilation_rate": [1], "kernel_size": [9], "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "trainable": true, "pool_size": [2], "padding": "valid", "strides": [2]}}, {"class_name": "Conv1D", "config": {"activity_regularizer": null, "filters": 256, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "padding": "same", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "strides": [1], "name": "conv1d_3", "bias_regularizer": null, "dilation_rate": [1], "kernel_size": [9], "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_3", "trainable": true, "pool_size": [2], "padding": "valid", "strides": [2]}}, {"class_name": "Conv1D", "config": {"activity_regularizer": null, "filters": 512, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "padding": "same", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "strides": [1], "name": "conv1d_4", "bias_regularizer": null, "dilation_rate": [1], "kernel_size": [8], "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_4", "trainable": true, "pool_size": [2], "padding": "valid", "strides": [2]}}, {"class_name": "Conv1D", "config": {"activity_regularizer": null, "filters": 1024, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "padding": "same", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "strides": [1], "name": "conv1d_5", "bias_regularizer": null, "dilation_rate": [1], "kernel_size": [3], "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5", "trainable": true, "pool_size": [1], "padding": "valid", "strides": [1]}}, {"class_name": "Conv1D", "config": {"activity_regularizer": null, "filters": 144, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "padding": "same", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "strides": [1], "name": "conv1d_6", "bias_regularizer": null, "dilation_rate": [1], "kernel_size": [1], "bias_constraint": null}}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "bias_constraint": null, "name": "dense_1", "bias_regularizer": null, "units": 128}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.25}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activity_regularizer": null, "activation": "softmax", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "bias_constraint": null, "name": "output_layer", "bias_regularizer": null, "units": 2}}]}