{"keras_version": "2.1.6", "class_name": "Sequential", "config": [{"class_name": "Conv1D", "config": {"filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "kernel_constraint": null, "activation": "linear", "strides": [1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "use_bias": true, "bias_constraint": null, "kernel_size": [9], "padding": "same", "dilation_rate": [1], "name": "conv1d_1", "batch_input_shape": [null, 34, 20]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "name": "max_pooling1d_1", "padding": "valid", "strides": [2], "pool_size": [2]}}, {"class_name": "Conv1D", "config": {"filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "kernel_constraint": null, "activation": "relu", "strides": [1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_size": [9], "padding": "same", "dilation_rate": [1], "name": "conv1d_2"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "name": "max_pooling1d_2", "padding": "valid", "strides": [2], "pool_size": [2]}}, {"class_name": "Conv1D", "config": {"filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "kernel_constraint": null, "activation": "relu", "strides": [1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_size": [9], "padding": "same", "dilation_rate": [1], "name": "conv1d_3"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "name": "max_pooling1d_3", "padding": "valid", "strides": [2], "pool_size": [2]}}, {"class_name": "Conv1D", "config": {"filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "kernel_constraint": null, "activation": "relu", "strides": [1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_size": [8], "padding": "same", "dilation_rate": [1], "name": "conv1d_4"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "name": "max_pooling1d_4", "padding": "valid", "strides": [2], "pool_size": [2]}}, {"class_name": "Conv1D", "config": {"filters": 1024, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "kernel_constraint": null, "activation": "relu", "strides": [1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_size": [3], "padding": "same", "dilation_rate": [1], "name": "conv1d_5"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "name": "max_pooling1d_5", "padding": "valid", "strides": [1], "pool_size": [1]}}, {"class_name": "Conv1D", "config": {"filters": 144, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "kernel_constraint": null, "activation": "relu", "strides": [1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_size": [1], "padding": "same", "dilation_rate": [1], "name": "conv1d_6"}}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "units": 128, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "units": 2, "name": "output_layer"}}], "backend": "tensorflow"}