{"class_name": "Sequential", "config": [{"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "strides": [1], "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 96, "name": "conv1d_1", "use_bias": true, "batch_input_shape": [null, 34, 20], "dtype": "float32", "kernel_size": [9], "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "kernel_constraint": null, "padding": "valid"}}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "strides": [1], "dilation_rate": [1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_2", "activity_regularizer": null, "kernel_size": [9], "trainable": true, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same"}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_1", "center": true, "trainable": true, "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "name": "max_pooling1d_1", "pool_size": [3], "strides": [2], "padding": "same"}}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "strides": [1], "dilation_rate": [1], "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_3", "activity_regularizer": null, "kernel_size": [9], "trainable": true, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same"}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_2", "center": true, "trainable": true, "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "name": "max_pooling1d_2", "pool_size": [3], "strides": [2], "padding": "same"}}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "strides": [1], "dilation_rate": [1], "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_4", "activity_regularizer": null, "kernel_size": [8], "trainable": true, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same"}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_3", "center": true, "trainable": true, "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99}}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "strides": [1], "dilation_rate": [1], "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_5", "activity_regularizer": null, "kernel_size": [3], "trainable": true, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same"}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_4", "center": true, "trainable": true, "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "name": "max_pooling1d_3", "pool_size": [3], "strides": [2], "padding": "same"}}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "strides": [1], "dilation_rate": [1], "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_6", "activity_regularizer": null, "kernel_size": [3], "trainable": true, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same"}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_5", "center": true, "trainable": true, "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99}}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "strides": [1], "dilation_rate": [1], "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_7", "activity_regularizer": null, "kernel_size": [3], "trainable": true, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same"}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_6", "center": true, "trainable": true, "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "name": "max_pooling1d_4", "pool_size": [3], "strides": [2], "padding": "same"}}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "strides": [1], "dilation_rate": [1], "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_8", "activity_regularizer": null, "kernel_size": [3], "trainable": true, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same"}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_7", "center": true, "trainable": true, "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99}}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "strides": [1], "dilation_rate": [1], "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_9", "activity_regularizer": null, "kernel_size": [1], "trainable": true, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same"}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_8", "center": true, "trainable": true, "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "name": "max_pooling1d_5", "pool_size": [3], "strides": [2], "padding": "same"}}, {"class_name": "AveragePooling1D", "config": {"trainable": true, "name": "average_pooling1d_1", "pool_size": [1], "strides": [1], "padding": "valid"}}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "units": 2, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "output_layer", "activation": "softmax", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}}], "keras_version": "2.1.6", "backend": "tensorflow"}