{"backend": "tensorflow", "config": [{"config": {"dilation_rate": [1], "strides": [1], "padding": "valid", "kernel_constraint": null, "name": "conv1d_1", "dtype": "float32", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 34, 20], "filters": 96, "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [9], "use_bias": true, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv1D"}, {"config": {"dilation_rate": [1], "strides": [1], "padding": "valid", "kernel_constraint": null, "name": "conv1d_2", "trainable": true, "kernel_size": [9], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv1D"}, {"config": {"dilation_rate": [1], "strides": [1], "padding": "valid", "kernel_constraint": null, "name": "conv1d_3", "trainable": true, "kernel_size": [9], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 256, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv1D"}, {"config": {"dilation_rate": [1], "strides": [1], "padding": "valid", "kernel_constraint": null, "name": "conv1d_4", "trainable": true, "kernel_size": [8], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 512, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv1D"}, {"config": {"dilation_rate": [1], "strides": [1], "padding": "valid", "kernel_constraint": null, "name": "conv1d_5", "trainable": true, "kernel_size": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 144, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv1D"}, {"config": {"name": "global_max_pooling1d_1", "trainable": true}, "class_name": "GlobalMaxPooling1D"}, {"config": {"kernel_constraint": null, "name": "output_layer", "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "bias_regularizer": null, "units": 2, "bias_constraint": null, "use_bias": true, "activity_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.1.6", "class_name": "Sequential"}