{"class_name": "Sequential", "keras_version": "2.1.6", "backend": "tensorflow", "config": [{"class_name": "Conv1D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "use_bias": true, "activity_regularizer": null, "name": "conv1d_1", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1], "padding": "valid", "strides": [1], "dtype": "float32", "bias_constraint": null, "kernel_size": [9], "kernel_constraint": null, "batch_input_shape": [null, 34, 20], "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv1D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "use_bias": true, "activity_regularizer": null, "name": "conv1d_2", "activation": "relu", "dilation_rate": [1], "padding": "valid", "kernel_constraint": null, "bias_constraint": null, "strides": [1], "kernel_size": [9], "bias_regularizer": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv1D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "use_bias": true, "activity_regularizer": null, "name": "conv1d_3", "activation": "relu", "dilation_rate": [1], "padding": "valid", "kernel_constraint": null, "bias_constraint": null, "strides": [1], "kernel_size": [9], "bias_regularizer": null, "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv1D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "use_bias": true, "activity_regularizer": null, "name": "conv1d_4", "activation": "relu", "dilation_rate": [1], "padding": "valid", "kernel_constraint": null, "bias_constraint": null, "strides": [1], "kernel_size": [8], "bias_regularizer": null, "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv1D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "use_bias": true, "activity_regularizer": null, "name": "conv1d_5", "activation": "relu", "dilation_rate": [1], "padding": "valid", "kernel_constraint": null, "bias_constraint": null, "strides": [1], "kernel_size": [3], "bias_regularizer": null, "filters": 1024, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv1D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "use_bias": true, "activity_regularizer": null, "name": "conv1d_6", "activation": "relu", "dilation_rate": [1], "padding": "valid", "kernel_constraint": null, "bias_constraint": null, "strides": [1], "kernel_size": [1], "bias_regularizer": null, "filters": 144, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.2, "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "name": "output_layer", "activation": "softmax", "trainable": true, "kernel_constraint": null, "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}