{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv1D", "config": {"kernel_constraint": null, "name": "conv1d_1", "bias_constraint": null, "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 34, 20], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "strides": [1], "use_bias": true, "activity_regularizer": null, "dtype": "float32", "trainable": true, "dilation_rate": [1], "bias_regularizer": null, "kernel_size": [9], "activation": "linear"}}, {"class_name": "Conv1D", "config": {"name": "conv1d_2", "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "valid", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 128, "dilation_rate": [1], "bias_regularizer": null, "kernel_size": [9], "activation": "linear"}}, {"class_name": "Conv1D", "config": {"name": "conv1d_3", "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "valid", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 256, "dilation_rate": [1], "bias_regularizer": null, "kernel_size": [9], "activation": "linear"}}, {"class_name": "Conv1D", "config": {"name": "conv1d_4", "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "valid", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 512, "dilation_rate": [1], "bias_regularizer": null, "kernel_size": [8], "activation": "linear"}}, {"class_name": "Conv1D", "config": {"name": "conv1d_5", "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "valid", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 144, "dilation_rate": [1], "bias_regularizer": null, "kernel_size": [1], "activation": "linear"}}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "output_layer", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "units": 2, "bias_regularizer": null, "activation": "softmax"}}], "keras_version": "2.1.6"}