{"config": {"name": "model_1", "input_layers": [["inp", 0, 0]], "layers": [{"name": "inp", "config": {"name": "inp", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 34, 20]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "conv1d_2", "config": {"trainable": true, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_size": [3], "activity_regularizer": null, "kernel_constraint": null, "strides": [1], "name": "conv1d_2", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "filters": 64, "activation": "sigmoid", "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}}, "inbound_nodes": [[["inp", 0, 0, {}]]], "class_name": "Conv1D"}, {"name": "conv1d_3", "config": {"trainable": true, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_size": [5], "activity_regularizer": null, "kernel_constraint": null, "strides": [1], "name": "conv1d_3", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "filters": 64, "activation": "sigmoid", "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}}, "inbound_nodes": [[["inp", 0, 0, {}]]], "class_name": "Conv1D"}, {"name": "conv1d_4", "config": {"trainable": true, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_size": [7], "activity_regularizer": null, "kernel_constraint": null, "strides": [1], "name": "conv1d_4", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "filters": 64, "activation": "sigmoid", "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}}, "inbound_nodes": [[["inp", 0, 0, {}]]], "class_name": "Conv1D"}, {"name": "conv1d_5", "config": {"trainable": true, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_size": [9], "activity_regularizer": null, "kernel_constraint": null, "strides": [1], "name": "conv1d_5", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "filters": 64, "activation": "sigmoid", "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}}, "inbound_nodes": [[["inp", 0, 0, {}]]], "class_name": "Conv1D"}, {"name": "conv1d_6", "config": {"trainable": true, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_size": [9], "activity_regularizer": null, "kernel_constraint": null, "strides": [1], "name": "conv1d_6", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "filters": 64, "activation": "sigmoid", "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}}, "inbound_nodes": [[["inp", 0, 0, {}]]], "class_name": "Conv1D"}, {"name": "batch_normalization_1", "config": {"trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "name": "batch_normalization_1", "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}, "inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_2", "config": {"trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "name": "batch_normalization_2", "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}, "inbound_nodes": [[["conv1d_3", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_3", "config": {"trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "name": "batch_normalization_3", "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}, "inbound_nodes": [[["conv1d_4", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_4", "config": {"trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "name": "batch_normalization_4", "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}, "inbound_nodes": [[["conv1d_5", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_5", "config": {"trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "name": "batch_normalization_5", "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}, "inbound_nodes": [[["conv1d_6", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "concatenate_1", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}], ["batch_normalization_2", 0, 0, {}], ["batch_normalization_3", 0, 0, {}], ["batch_normalization_4", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "dense_1", "config": {"trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "name": "dense_1", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "relu", "bias_regularizer": null, "units": 180}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "global_max_pooling1d_1", "config": {"name": "global_max_pooling1d_1", "trainable": true}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "GlobalMaxPooling1D"}, {"name": "output_layer", "config": {"trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "output_layer", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "softmax", "bias_regularizer": null, "units": 2}, "inbound_nodes": [[["global_max_pooling1d_1", 0, 0, {}]]], "class_name": "Dense"}], "output_layers": [["output_layer", 0, 0]]}, "keras_version": "2.1.6", "backend": "tensorflow", "class_name": "Model"}