{"config": [{"config": {"dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "batch_input_shape": [null, 34, 20], "activation": "linear", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1], "strides": [1], "activity_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv1d_1", "kernel_size": [9], "bias_constraint": null, "filters": 96, "trainable": true, "padding": "valid"}, "class_name": "Conv1D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1], "strides": [1], "activity_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv1d_2", "kernel_size": [9], "bias_constraint": null, "filters": 128, "trainable": true, "padding": "valid"}, "class_name": "Conv1D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1], "strides": [1], "activity_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv1d_3", "kernel_size": [9], "bias_constraint": null, "filters": 256, "trainable": true, "padding": "valid"}, "class_name": "Conv1D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1], "strides": [1], "activity_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv1d_4", "kernel_size": [8], "bias_constraint": null, "filters": 512, "trainable": true, "padding": "valid"}, "class_name": "Conv1D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1], "strides": [1], "activity_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv1d_5", "kernel_size": [3], "bias_constraint": null, "filters": 1024, "trainable": true, "padding": "valid"}, "class_name": "Conv1D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1], "strides": [1], "activity_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv1d_6", "kernel_size": [1], "bias_constraint": null, "filters": 144, "trainable": true, "padding": "valid"}, "class_name": "Conv1D"}, {"config": {"trainable": true, "name": "global_max_pooling1d_1"}, "class_name": "GlobalMaxPooling1D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "units": 2, "bias_regularizer": null, "activation": "softmax", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null, "name": "output_layer", "bias_constraint": null, "trainable": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6"}