{"class_name": "Sequential", "config": [{"class_name": "Conv1D", "config": {"use_bias": true, "kernel_constraint": null, "dilation_rate": [1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "batch_input_shape": [null, 34, 20], "trainable": true, "name": "conv1d_1", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "kernel_size": [9], "activity_regularizer": null, "dtype": "float32", "bias_constraint": null, "filters": 96, "strides": [1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid"}}, {"class_name": "Conv1D", "config": {"use_bias": true, "kernel_constraint": null, "dilation_rate": [1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "name": "conv1d_2", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "kernel_size": [9], "activity_regularizer": null, "bias_constraint": null, "filters": 128, "strides": [1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid"}}, {"class_name": "Conv1D", "config": {"use_bias": true, "kernel_constraint": null, "dilation_rate": [1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "name": "conv1d_3", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "kernel_size": [9], "activity_regularizer": null, "bias_constraint": null, "filters": 256, "strides": [1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid"}}, {"class_name": "Conv1D", "config": {"use_bias": true, "kernel_constraint": null, "dilation_rate": [1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "name": "conv1d_4", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "kernel_size": [8], "activity_regularizer": null, "bias_constraint": null, "filters": 512, "strides": [1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid"}}, {"class_name": "GlobalMaxPooling1D", "config": {"trainable": true, "name": "global_max_pooling1d_1"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "name": "output_layer", "kernel_regularizer": null, "units": 2, "activity_regularizer": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}], "backend": "tensorflow", "keras_version": "2.1.6"}