{"keras_version": "2.1.6", "backend": "tensorflow", "config": [{"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "dtype": "float32", "padding": "valid", "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "strides": [1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "name": "conv1d_1", "filters": 96, "kernel_size": [9], "batch_input_shape": [null, 34, 20], "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "dilation_rate": [1], "bias_constraint": null}, "class_name": "Conv1D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "padding": "valid", "bias_regularizer": null, "kernel_constraint": null, "strides": [1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "name": "conv1d_2", "filters": 128, "kernel_size": [9], "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "dilation_rate": [1], "bias_constraint": null}, "class_name": "Conv1D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "padding": "valid", "bias_regularizer": null, "kernel_constraint": null, "strides": [1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "name": "conv1d_3", "filters": 256, "kernel_size": [9], "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "dilation_rate": [1], "bias_constraint": null}, "class_name": "Conv1D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "padding": "valid", "bias_regularizer": null, "kernel_constraint": null, "strides": [1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "name": "conv1d_4", "filters": 512, "kernel_size": [8], "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "dilation_rate": [1], "bias_constraint": null}, "class_name": "Conv1D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "padding": "valid", "bias_regularizer": null, "kernel_constraint": null, "strides": [1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "name": "conv1d_5", "filters": 1024, "kernel_size": [3], "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "dilation_rate": [1], "bias_constraint": null}, "class_name": "Conv1D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "padding": "valid", "bias_regularizer": null, "kernel_constraint": null, "strides": [1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "name": "conv1d_6", "filters": 144, "kernel_size": [1], "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "dilation_rate": [1], "bias_constraint": null}, "class_name": "Conv1D"}, {"config": {"trainable": true, "name": "global_max_pooling1d_1"}, "class_name": "GlobalMaxPooling1D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "units": 2, "trainable": true, "kernel_regularizer": null, "name": "output_layer", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}