{"keras_version": "2.1.6", "backend": "tensorflow", "config": [{"class_name": "Conv1D", "config": {"bias_constraint": null, "activity_regularizer": null, "name": "conv1d_1", "batch_input_shape": [null, 34, 20], "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "strides": [1], "kernel_constraint": null, "dilation_rate": [1], "trainable": true, "bias_regularizer": null, "kernel_size": [3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "padding": "same", "filters": 64, "use_bias": true}}, {"class_name": "Conv1D", "config": {"bias_constraint": null, "activity_regularizer": null, "name": "conv1d_2", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "strides": [1], "kernel_constraint": null, "dilation_rate": [1], "trainable": true, "bias_regularizer": null, "kernel_size": [5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 64, "use_bias": true, "padding": "same"}}, {"class_name": "Conv1D", "config": {"bias_constraint": null, "activity_regularizer": null, "name": "conv1d_3", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "strides": [1], "kernel_constraint": null, "dilation_rate": [1], "trainable": true, "bias_regularizer": null, "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 64, "use_bias": true, "padding": "same"}}, {"class_name": "Conv1D", "config": {"bias_constraint": null, "activity_regularizer": null, "name": "conv1d_4", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "strides": [1], "kernel_constraint": null, "dilation_rate": [1], "trainable": true, "bias_regularizer": null, "kernel_size": [9], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 64, "use_bias": true, "padding": "same"}}, {"class_name": "Conv1D", "config": {"bias_constraint": null, "activity_regularizer": null, "name": "conv1d_5", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "strides": [1], "kernel_constraint": null, "dilation_rate": [1], "trainable": true, "bias_regularizer": null, "kernel_size": [11], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 64, "use_bias": true, "padding": "same"}}, {"class_name": "Conv1D", "config": {"bias_constraint": null, "activity_regularizer": null, "name": "conv1d_6", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "strides": [1], "kernel_constraint": null, "dilation_rate": [1], "trainable": true, "bias_regularizer": null, "kernel_size": [19], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 64, "use_bias": true, "padding": "same"}}, {"class_name": "Conv1D", "config": {"bias_constraint": null, "activity_regularizer": null, "name": "conv1d_7", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "strides": [1], "kernel_constraint": null, "dilation_rate": [1], "trainable": true, "bias_regularizer": null, "kernel_size": [35], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 64, "use_bias": true, "padding": "same"}}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activity_regularizer": null, "name": "output_layer", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "kernel_constraint": null, "units": 2, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "trainable": true}}], "class_name": "Sequential"}