{"class_name": "Sequential", "keras_version": "2.1.6", "backend": "tensorflow", "config": [{"class_name": "Conv1D", "config": {"trainable": true, "activity_regularizer": null, "dilation_rate": [1], "bias_regularizer": null, "filters": 96, "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "kernel_size": [9], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_1", "padding": "valid", "bias_constraint": null, "activation": "linear", "use_bias": true, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1], "batch_input_shape": [null, 34, 20]}}, {"class_name": "Conv1D", "config": {"trainable": true, "activity_regularizer": null, "dilation_rate": [1], "bias_regularizer": null, "filters": 128, "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "kernel_size": [9], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "bias_constraint": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1], "name": "conv1d_2"}}, {"class_name": "Conv1D", "config": {"trainable": true, "activity_regularizer": null, "dilation_rate": [1], "bias_regularizer": null, "filters": 256, "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "kernel_size": [9], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "bias_constraint": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1], "name": "conv1d_3"}}, {"class_name": "Conv1D", "config": {"trainable": true, "activity_regularizer": null, "dilation_rate": [1], "bias_regularizer": null, "filters": 512, "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "kernel_size": [8], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "bias_constraint": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1], "name": "conv1d_4"}}, {"class_name": "Conv1D", "config": {"trainable": true, "activity_regularizer": null, "dilation_rate": [1], "bias_regularizer": null, "filters": 1024, "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "kernel_size": [3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "bias_constraint": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1], "name": "conv1d_5"}}, {"class_name": "Conv1D", "config": {"trainable": true, "activity_regularizer": null, "dilation_rate": [1], "bias_regularizer": null, "filters": 144, "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "kernel_size": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "bias_constraint": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1], "name": "conv1d_6"}}, {"class_name": "GlobalMaxPooling1D", "config": {"trainable": true, "name": "global_max_pooling1d_1"}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.1, "noise_shape": null, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "output_layer", "kernel_constraint": null, "bias_constraint": null, "activation": "softmax", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "units": 2}}]}