{"backend": "tensorflow", "config": [{"config": {"use_bias": true, "batch_input_shape": [null, 34, 20], "dtype": "float32", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "padding": "same", "strides": [1], "trainable": true, "filters": 64, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3], "name": "conv1d_1", "kernel_constraint": null}, "class_name": "Conv1D"}, {"config": {"use_bias": true, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "padding": "same", "strides": [1], "trainable": true, "filters": 64, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [5], "name": "conv1d_2", "kernel_constraint": null}, "class_name": "Conv1D"}, {"config": {"use_bias": true, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "padding": "same", "strides": [1], "trainable": true, "filters": 64, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [7], "name": "conv1d_3", "kernel_constraint": null}, "class_name": "Conv1D"}, {"config": {"use_bias": true, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "padding": "same", "strides": [1], "trainable": true, "filters": 64, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [9], "name": "conv1d_4", "kernel_constraint": null}, "class_name": "Conv1D"}, {"config": {"use_bias": true, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "padding": "same", "strides": [1], "trainable": true, "filters": 64, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [11], "name": "conv1d_5", "kernel_constraint": null}, "class_name": "Conv1D"}, {"config": {"name": "global_max_pooling1d_1", "trainable": true}, "class_name": "GlobalMaxPooling1D"}, {"config": {"use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "units": 2, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "softmax", "name": "output_layer", "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.1.6", "class_name": "Sequential"}