{"keras_version": "2.1.6", "config": [{"config": {"activity_regularizer": null, "activation": "linear", "batch_input_shape": [null, 34, 20], "use_bias": true, "dilation_rate": [1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "kernel_size": [3], "dtype": "float32", "strides": [1], "name": "conv1d_1", "filters": 64, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "bias_regularizer": null}, "class_name": "Conv1D"}, {"config": {"activity_regularizer": null, "activation": "linear", "bias_constraint": null, "use_bias": true, "dilation_rate": [1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "kernel_size": [5], "padding": "same", "strides": [1], "name": "conv1d_2", "filters": 64, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Conv1D"}, {"config": {"activity_regularizer": null, "activation": "linear", "bias_constraint": null, "use_bias": true, "dilation_rate": [1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "kernel_size": [7], "padding": "same", "strides": [1], "name": "conv1d_3", "filters": 64, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Conv1D"}, {"config": {"activity_regularizer": null, "activation": "linear", "bias_constraint": null, "use_bias": true, "dilation_rate": [1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "kernel_size": [9], "padding": "same", "strides": [1], "name": "conv1d_4", "filters": 64, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Conv1D"}, {"config": {"activity_regularizer": null, "activation": "linear", "bias_constraint": null, "use_bias": true, "dilation_rate": [1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "kernel_size": [11], "padding": "same", "strides": [1], "name": "conv1d_5", "filters": 64, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Conv1D"}, {"config": {"trainable": true, "name": "global_max_pooling1d_1"}, "class_name": "GlobalMaxPooling1D"}, {"config": {"activity_regularizer": null, "activation": "softmax", "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "output_layer", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}