{"class_name": "Sequential", "keras_version": "2.1.6", "config": [{"class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 64, "trainable": true, "name": "conv1d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_size": [3], "bias_regularizer": null, "padding": "same", "use_bias": true, "batch_input_shape": [null, 34, 20], "dtype": "float32", "dilation_rate": [1], "activation": "linear", "strides": [1], "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}}}, {"class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 64, "trainable": true, "name": "conv1d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_size": [5], "bias_regularizer": null, "padding": "same", "use_bias": true, "activation": "linear", "dilation_rate": [1], "strides": [1], "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}}}, {"class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 64, "trainable": true, "name": "conv1d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_size": [7], "bias_regularizer": null, "padding": "same", "use_bias": true, "activation": "linear", "dilation_rate": [1], "strides": [1], "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}}}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "use_bias": true, "units": 2, "activation": "softmax", "kernel_regularizer": null, "kernel_constraint": null, "name": "output_layer"}}], "backend": "tensorflow"}