{"config": [{"class_name": "Conv1D", "config": {"kernel_size": [9], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_constraint": null, "dtype": "float32", "dilation_rate": [1], "filters": 96, "name": "conv1d_1", "activation": "linear", "batch_input_shape": [null, 34, 20], "bias_regularizer": null, "trainable": true, "padding": "valid", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv1D", "config": {"kernel_size": [9], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "bias_constraint": null, "dilation_rate": [1], "filters": 128, "kernel_constraint": null, "name": "conv1d_2", "trainable": true, "bias_regularizer": null, "padding": "valid", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv1D", "config": {"kernel_size": [9], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "bias_constraint": null, "dilation_rate": [1], "filters": 256, "kernel_constraint": null, "name": "conv1d_3", "trainable": true, "bias_regularizer": null, "padding": "valid", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv1D", "config": {"kernel_size": [8], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "bias_constraint": null, "dilation_rate": [1], "filters": 512, "kernel_constraint": null, "name": "conv1d_4", "trainable": true, "bias_regularizer": null, "padding": "valid", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv1D", "config": {"kernel_size": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "bias_constraint": null, "dilation_rate": [1], "filters": 144, "kernel_constraint": null, "name": "conv1d_5", "trainable": true, "bias_regularizer": null, "padding": "valid", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "units": 2, "bias_constraint": null, "use_bias": true, "name": "output_layer", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6"}