{"keras_version": "2.1.6", "backend": "tensorflow", "config": [{"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv1d_1", "trainable": true, "filters": 64, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1], "batch_input_shape": [null, 34, 20], "bias_regularizer": null, "kernel_size": [3], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "padding": "same", "strides": [1], "kernel_constraint": null}, "class_name": "Conv1D"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv1d_2", "trainable": true, "filters": 64, "bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "bias_regularizer": null, "kernel_size": [5], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "padding": "same", "strides": [1], "kernel_constraint": null}, "class_name": "Conv1D"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv1d_3", "trainable": true, "filters": 64, "bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "bias_regularizer": null, "kernel_size": [7], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "padding": "same", "strides": [1], "kernel_constraint": null}, "class_name": "Conv1D"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv1d_4", "trainable": true, "filters": 64, "bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "bias_regularizer": null, "kernel_size": [9], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "padding": "same", "strides": [1], "kernel_constraint": null}, "class_name": "Conv1D"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv1d_5", "trainable": true, "filters": 64, "bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "bias_regularizer": null, "kernel_size": [11], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "padding": "same", "strides": [1], "kernel_constraint": null}, "class_name": "Conv1D"}, {"config": {"name": "global_max_pooling1d_1", "trainable": true}, "class_name": "GlobalMaxPooling1D"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 2, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "activation": "softmax", "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "output_layer", "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}