{"class_name": "Sequential", "keras_version": "2.1.6", "backend": "tensorflow", "config": [{"class_name": "Conv1D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "dilation_rate": [1], "bias_regularizer": null, "name": "conv1d_1", "use_bias": true, "strides": [1], "bias_constraint": null, "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 96, "dtype": "float32", "batch_input_shape": [null, 34, 20], "kernel_constraint": null, "padding": "valid", "kernel_size": [9], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"class_name": "Conv1D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "dilation_rate": [1], "bias_regularizer": null, "name": "conv1d_2", "use_bias": true, "strides": [1], "bias_constraint": null, "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "kernel_constraint": null, "padding": "valid", "kernel_size": [9], "activity_regularizer": null}}, {"class_name": "Conv1D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "dilation_rate": [1], "bias_regularizer": null, "name": "conv1d_3", "use_bias": true, "strides": [1], "bias_constraint": null, "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "kernel_constraint": null, "padding": "valid", "kernel_size": [9], "activity_regularizer": null}}, {"class_name": "Conv1D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "dilation_rate": [1], "bias_regularizer": null, "name": "conv1d_4", "use_bias": true, "strides": [1], "bias_constraint": null, "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "kernel_constraint": null, "padding": "valid", "kernel_size": [8], "activity_regularizer": null}}, {"class_name": "Conv1D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "dilation_rate": [1], "bias_regularizer": null, "name": "conv1d_5", "use_bias": true, "strides": [1], "bias_constraint": null, "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 1024, "kernel_constraint": null, "padding": "valid", "kernel_size": [3], "activity_regularizer": null}}, {"class_name": "Conv1D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "dilation_rate": [1], "bias_regularizer": null, "name": "conv1d_6", "use_bias": true, "strides": [1], "bias_constraint": null, "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 144, "kernel_constraint": null, "padding": "valid", "kernel_size": [1], "activity_regularizer": null}}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "output_layer", "use_bias": true, "units": 2, "trainable": true, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null}}]}