{"config": [{"config": {"use_bias": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "activation": "linear", "strides": [1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [9], "filters": 96, "dilation_rate": [1], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 34, 20], "trainable": true, "name": "conv1d_1"}, "class_name": "Conv1D"}, {"config": {"seed": null, "name": "dropout_1", "trainable": true, "noise_shape": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"pool_size": [2], "padding": "valid", "name": "max_pooling1d_1", "trainable": true, "strides": [2]}, "class_name": "MaxPooling1D"}, {"config": {"use_bias": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "strides": [1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [9], "filters": 128, "dilation_rate": [1], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "name": "conv1d_2"}, "class_name": "Conv1D"}, {"config": {"pool_size": [2], "padding": "valid", "name": "max_pooling1d_2", "trainable": true, "strides": [2]}, "class_name": "MaxPooling1D"}, {"config": {"use_bias": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "strides": [1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [9], "filters": 256, "dilation_rate": [1], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "name": "conv1d_3"}, "class_name": "Conv1D"}, {"config": {"pool_size": [2], "padding": "valid", "name": "max_pooling1d_3", "trainable": true, "strides": [2]}, "class_name": "MaxPooling1D"}, {"config": {"use_bias": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "strides": [1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [8], "filters": 512, "dilation_rate": [1], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "name": "conv1d_4"}, "class_name": "Conv1D"}, {"config": {"pool_size": [2], "padding": "valid", "name": "max_pooling1d_4", "trainable": true, "strides": [2]}, "class_name": "MaxPooling1D"}, {"config": {"use_bias": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "strides": [1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3], "filters": 256, "dilation_rate": [1], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "name": "conv1d_5"}, "class_name": "Conv1D"}, {"config": {"pool_size": [1], "padding": "valid", "name": "max_pooling1d_5", "trainable": true, "strides": [1]}, "class_name": "MaxPooling1D"}, {"config": {"use_bias": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "strides": [1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [1], "filters": 144, "dilation_rate": [1], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "name": "conv1d_6"}, "class_name": "Conv1D"}, {"config": {"name": "global_max_pooling1d_1", "trainable": true}, "class_name": "GlobalMaxPooling1D"}, {"config": {"seed": null, "name": "dropout_2", "trainable": true, "noise_shape": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"use_bias": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "output_layer", "activation": "softmax", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "units": 2}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.6"}