{"keras_version": "2.1.6", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv1D", "config": {"activity_regularizer": null, "activation": "linear", "strides": [1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [9], "trainable": true, "name": "conv1d_1", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "dtype": "float32", "filters": 96, "padding": "valid", "use_bias": true, "bias_constraint": null, "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "batch_input_shape": [null, 34, 20]}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "name": "max_pooling1d_1", "strides": [2], "pool_size": [2], "padding": "valid"}}, {"class_name": "Conv1D", "config": {"activity_regularizer": null, "activation": "relu", "strides": [1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [9], "trainable": true, "name": "conv1d_2", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 128, "padding": "same", "use_bias": true, "bias_constraint": null, "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "name": "max_pooling1d_2", "strides": [2], "pool_size": [2], "padding": "valid"}}, {"class_name": "Conv1D", "config": {"activity_regularizer": null, "activation": "relu", "strides": [1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [9], "trainable": true, "name": "conv1d_3", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 256, "padding": "same", "use_bias": true, "bias_constraint": null, "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "name": "max_pooling1d_3", "strides": [1], "pool_size": [1], "padding": "valid"}}, {"class_name": "Conv1D", "config": {"activity_regularizer": null, "activation": "relu", "strides": [1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1], "trainable": true, "name": "conv1d_4", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 144, "padding": "same", "use_bias": true, "bias_constraint": null, "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}}, {"class_name": "GlobalMaxPooling1D", "config": {"trainable": true, "name": "global_max_pooling1d_1"}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.1, "trainable": true, "name": "dropout_1", "noise_shape": null}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "softmax", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "output_layer", "units": 2, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null}}]}