{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"dtype": "float32", "use_bias": true, "kernel_constraint": null, "batch_input_shape": [null, 34, 21], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "units": 34, "activation": "relu"}}, {"class_name": "Dense", "config": {"units": 34, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "activation": "relu"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"units": 1, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "activation": "sigmoid"}}], "backend": "tensorflow", "keras_version": "2.1.6"}