{"class_name": "Sequential", "config": [{"class_name": "Conv1D", "config": {"kernel_size": [9], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "name": "conv1d_1", "strides": [1], "dtype": "float32", "bias_regularizer": null, "filters": 96, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "batch_input_shape": [null, 34, 20], "padding": "valid", "dilation_rate": [1], "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"strides": [2], "trainable": true, "pool_size": [2], "name": "max_pooling1d_1", "padding": "valid"}}, {"class_name": "Conv1D", "config": {"kernel_size": [9], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "name": "conv1d_2", "strides": [1], "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "padding": "same", "dilation_rate": [1], "filters": 128}}, {"class_name": "MaxPooling1D", "config": {"strides": [2], "trainable": true, "pool_size": [2], "name": "max_pooling1d_2", "padding": "valid"}}, {"class_name": "Conv1D", "config": {"kernel_size": [9], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "name": "conv1d_3", "strides": [1], "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "padding": "same", "dilation_rate": [1], "filters": 256}}, {"class_name": "MaxPooling1D", "config": {"strides": [2], "trainable": true, "pool_size": [2], "name": "max_pooling1d_3", "padding": "valid"}}, {"class_name": "Conv1D", "config": {"kernel_size": [8], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "name": "conv1d_4", "strides": [1], "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "padding": "same", "dilation_rate": [1], "filters": 512}}, {"class_name": "MaxPooling1D", "config": {"strides": [2], "trainable": true, "pool_size": [2], "name": "max_pooling1d_4", "padding": "valid"}}, {"class_name": "Conv1D", "config": {"kernel_size": [3], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "name": "conv1d_5", "strides": [1], "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "padding": "same", "dilation_rate": [1], "filters": 1024}}, {"class_name": "MaxPooling1D", "config": {"strides": [1], "trainable": true, "pool_size": [1], "name": "max_pooling1d_5", "padding": "valid"}}, {"class_name": "Conv1D", "config": {"kernel_size": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "name": "conv1d_6", "strides": [1], "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "padding": "same", "dilation_rate": [1], "filters": 144}}, {"class_name": "GlobalMaxPooling1D", "config": {"trainable": true, "name": "global_max_pooling1d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "rate": 0.1, "seed": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "softmax", "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "units": 2, "name": "output_layer", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}], "backend": "tensorflow", "keras_version": "2.1.6"}