{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_constraint": null, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_1", "bias_regularizer": null, "padding": "same", "dtype": "float32", "strides": [1], "activation": "linear", "activity_regularizer": null, "filters": 96, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "batch_input_shape": [null, 34, 20], "kernel_constraint": null, "trainable": true, "use_bias": true, "kernel_size": [9]}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "seed": null, "name": "dropout_1", "noise_shape": null}}, {"class_name": "MaxPooling1D", "config": {"strides": [2], "trainable": true, "padding": "valid", "name": "max_pooling1d_1", "pool_size": [2]}}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_constraint": null, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_2", "bias_regularizer": null, "padding": "same", "strides": [1], "activation": "relu", "activity_regularizer": null, "filters": 128, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "kernel_constraint": null, "trainable": true, "use_bias": true, "kernel_size": [5]}}, {"class_name": "MaxPooling1D", "config": {"strides": [2], "trainable": true, "padding": "valid", "name": "max_pooling1d_2", "pool_size": [2]}}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_constraint": null, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_3", "bias_regularizer": null, "padding": "same", "strides": [1], "activation": "relu", "activity_regularizer": null, "filters": 256, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "kernel_constraint": null, "trainable": true, "use_bias": true, "kernel_size": [3]}}, {"class_name": "MaxPooling1D", "config": {"strides": [1], "trainable": true, "padding": "valid", "name": "max_pooling1d_3", "pool_size": [1]}}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_constraint": null, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_4", "bias_regularizer": null, "padding": "same", "strides": [1], "activation": "relu", "activity_regularizer": null, "filters": 144, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "kernel_constraint": null, "trainable": true, "use_bias": true, "kernel_size": [1]}}, {"class_name": "GlobalMaxPooling1D", "config": {"trainable": true, "name": "global_max_pooling1d_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "bias_regularizer": null, "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "units": 128}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "seed": null, "name": "dropout_2", "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "output_layer", "bias_regularizer": null, "activation": "softmax", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "units": 2}}], "keras_version": "2.1.6"}