{"class_name": "Sequential", "keras_version": "2.1.6", "backend": "tensorflow", "config": [{"class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "strides": [1], "filters": 96, "name": "conv1d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "bias_constraint": null, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "dtype": "float32", "batch_input_shape": [null, 34, 20], "use_bias": true, "kernel_size": [9], "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.5, "trainable": true, "name": "dropout_1", "seed": null}}, {"class_name": "MaxPooling1D", "config": {"pool_size": [2], "trainable": true, "padding": "valid", "name": "max_pooling1d_1", "strides": [2]}}, {"class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1], "bias_regularizer": null, "activation": "relu", "strides": [1], "filters": 128, "name": "conv1d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "bias_constraint": null, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "use_bias": true, "kernel_size": [9], "kernel_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"pool_size": [2], "trainable": true, "padding": "valid", "name": "max_pooling1d_2", "strides": [2]}}, {"class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1], "bias_regularizer": null, "activation": "relu", "strides": [1], "filters": 256, "name": "conv1d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "bias_constraint": null, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "use_bias": true, "kernel_size": [9], "kernel_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"pool_size": [2], "trainable": true, "padding": "valid", "name": "max_pooling1d_3", "strides": [2]}}, {"class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1], "bias_regularizer": null, "activation": "relu", "strides": [1], "filters": 512, "name": "conv1d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "bias_constraint": null, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "use_bias": true, "kernel_size": [8], "kernel_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"pool_size": [1], "trainable": true, "padding": "valid", "name": "max_pooling1d_4", "strides": [1]}}, {"class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1], "bias_regularizer": null, "activation": "relu", "strides": [1], "filters": 144, "name": "conv1d_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "bias_constraint": null, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "use_bias": true, "kernel_size": [1], "kernel_constraint": null}}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "trainable": true, "activation": "linear", "units": 128, "use_bias": true, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.25, "trainable": true, "name": "dropout_2", "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "output_layer", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "trainable": true, "activation": "softmax", "units": 2, "use_bias": true, "kernel_constraint": null}}]}