{"class_name": "Sequential", "config": [{"class_name": "Conv1D", "config": {"activation": "linear", "batch_input_shape": [null, 34, 20], "padding": "same", "bias_constraint": null, "activity_regularizer": null, "strides": [1], "use_bias": true, "trainable": true, "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "kernel_size": [9], "name": "conv1d_1", "dilation_rate": [1], "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.5, "noise_shape": null, "trainable": true, "seed": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "strides": [2], "pool_size": [2], "padding": "valid", "trainable": true}}, {"class_name": "Conv1D", "config": {"activation": "relu", "padding": "same", "bias_constraint": null, "activity_regularizer": null, "strides": [1], "use_bias": true, "trainable": true, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "kernel_size": [5], "name": "conv1d_2", "dilation_rate": [1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "strides": [2], "pool_size": [2], "padding": "valid", "trainable": true}}, {"class_name": "Conv1D", "config": {"activation": "relu", "padding": "same", "bias_constraint": null, "activity_regularizer": null, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "kernel_size": [3], "name": "conv1d_3", "dilation_rate": [1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_3", "strides": [1], "pool_size": [1], "padding": "valid", "trainable": true}}, {"class_name": "Conv1D", "config": {"activation": "relu", "padding": "same", "bias_constraint": null, "activity_regularizer": null, "strides": [1], "use_bias": true, "trainable": true, "filters": 144, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "kernel_size": [1], "name": "conv1d_4", "dilation_rate": [1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 128, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.25, "noise_shape": null, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"activation": "softmax", "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "name": "output_layer", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 2, "bias_regularizer": null}}], "keras_version": "2.1.6", "backend": "tensorflow"}