{"class_name": "Sequential", "keras_version": "2.1.6", "backend": "tensorflow", "config": [{"class_name": "Conv1D", "config": {"kernel_size": [9], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dtype": "float32", "activation": "linear", "strides": [1], "kernel_constraint": null, "bias_regularizer": null, "padding": "valid", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 34, 20], "dilation_rate": [1], "filters": 96, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_constraint": null, "name": "conv1d_1", "use_bias": true}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "trainable": true, "name": "max_pooling1d_1", "strides": [2], "pool_size": [2]}}, {"class_name": "Conv1D", "config": {"kernel_size": [9], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1], "kernel_constraint": null, "padding": "same", "trainable": true, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1], "filters": 128, "name": "conv1d_2", "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "trainable": true, "name": "max_pooling1d_2", "strides": [2], "pool_size": [2]}}, {"class_name": "Conv1D", "config": {"kernel_size": [9], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1], "kernel_constraint": null, "padding": "same", "trainable": true, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1], "filters": 256, "name": "conv1d_3", "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "trainable": true, "name": "max_pooling1d_3", "strides": [2], "pool_size": [2]}}, {"class_name": "Conv1D", "config": {"kernel_size": [8], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1], "kernel_constraint": null, "padding": "same", "trainable": true, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1], "filters": 512, "name": "conv1d_4", "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "trainable": true, "name": "max_pooling1d_4", "strides": [2], "pool_size": [2]}}, {"class_name": "Conv1D", "config": {"kernel_size": [3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1], "kernel_constraint": null, "padding": "same", "trainable": true, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1], "filters": 1024, "name": "conv1d_5", "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "trainable": true, "name": "max_pooling1d_5", "strides": [1], "pool_size": [1]}}, {"class_name": "Conv1D", "config": {"kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1], "kernel_constraint": null, "padding": "same", "trainable": true, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1], "filters": 144, "name": "conv1d_6", "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}}, {"class_name": "GlobalMaxPooling1D", "config": {"trainable": true, "name": "global_max_pooling1d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "noise_shape": null, "seed": null, "rate": 0.1}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "softmax", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "use_bias": true, "name": "output_layer", "bias_constraint": null, "units": 2}}]}