{"config": [{"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "bias_constraint": null, "activity_regularizer": null, "units": 40, "trainable": true, "use_bias": true, "batch_input_shape": [null, 34, 20, 1]}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "units": 40, "trainable": true, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "units": 1, "trainable": true, "use_bias": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6"}